config.org
#+OPTIONS: ^:nil
* Getting stuff up and running
** Getting package stuff set up
First and foremost, we have got to get some package archives set up so that we can slurp up all the amazing Emacs pacakges on the interwebs.

#+BEGIN_SRC emacs-lisp
  (require 'package)
  (setq package-enable-at-startup nil)
  (setq package-archives '(("org"       . "http://orgmode.org/elpa/")
			   ("gnu"       . "http://elpa.gnu.org/packages/")
			   ("MELPA Stable"     . "https://stable.melpa.org/packages/")))
#+END_SRC

I have never used ~use-package~ without ~:ensure t~, so we'll just have it enabled by default.

#+BEGIN_SRC emacs-lisp
(setq use-package-always-ensure t)
#+END_SRC

Straight.el works well for downloading packages directly from GitHub. The following is the code that the documentation says to put in your config. I have no idea what it does, but it works, and isn't that what really counts?

#+BEGIN_SRC emacs-lisp
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
#+END_SRC

You can integrate straight.el with use-package. By adding ~:straight t~ in use-package, you can download the package directly.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'use-package)
#+END_SRC

I am just going to use straight for everything because it works for almost everything.

#+BEGIN_SRC emacs-lisp
(setq straight-use-package-by-default t)
#+END_SRC

** Getting a good screen size
I have a big monitor, so I like to have a Chrome window open on the left side of the screen and Emacs open on the right side. To facilitate this, I automatically set the screen size and position on startup.

#+BEGIN_SRC emacs-lisp
(when window-system
  (set-frame-position (selected-frame) -1 -1)
  (set-frame-size (selected-frame) 140 120))
#+END_SRC

** Freeing up screen real estate
Conserve every last pixel. Get rid of the toolbar, scroll bar, menu bar. If it has the word "bar" in it, destroy it.

#+BEGIN_SRC emacs-lisp
(menu-bar-mode -1)
(tool-bar-mode -1) 
(blink-cursor-mode -1)
(scroll-bar-mode -1)
(global-hl-line-mode 1) 
(global-visual-line-mode 1)
#+END_SRC

** Some sensible defaults
These are some good ones.

#+BEGIN_SRC emacs-lisp
(setq coding-system-for-read 'utf-8
      coding-system-for-write 'utf-8
      default-file-name-coding-system 'utf-8
      ring-bell-function 'ignore ;; disable the sound of hell
      inhibit-startup-screen +1
      make-backup-files -1
      sentence-end-double-space nil
      default-fill-column 80)		

(set-language-environment 'utf-8)      
(prefer-coding-system 'utf-8)   
(set-default-coding-systems 'utf-8)                                                         
(set-terminal-coding-system 'utf-8)                                                         
(set-keyboard-coding-system 'utf-8)    

;; Treat clipboard input as UTF-8 string first; compound text next, etc.                    
(setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)) 
#+END_SRC

** Who am I?
And what is the meaning of my existence? Just kidding, Emacs is not for existentialism. We'll stick with the superficial for now.

#+BEGIN_SRC emacs-lisp
(setq user-full-name "Jeremy Clark"
      user-mail-address "jeremyclark456@gmail.com")
#+END_SRC

** Look like a cool hacker
I am bad at coding but good at looking like I'm good at coding. A badass theme always helps.
#+BEGIN_SRC emacs-lisp
  (use-package solarized-theme :straight t)
  (add-hook 'after-init-hook (lambda () (load-theme 'solarized-light :NO-CONFIRM t)))
#+END_SRC

* Keybinding shenanigans
** General and which-key
There must be a better way to do this, but I've written something and it works. I tried to figure out how to use macros to write this more efficiently, but I have not found a way. So for now, we will just stick with what works. First, we'll get ~general~ and ~which-key~, are two great keybinding packages. ~general~ integrates ~evil~ keybindings and ~which-key~ displays short descriptions for the keybindings, which can be really helpful if you forgot which keybinding does what.

#+BEGIN_SRC emacs-lisp
(use-package general
  :config (general-evil-setup))
(use-package which-key
  :init (which-key-mode)
  :config
  (setq which-key-popup-type 'minibuffer))
#+END_SRC

** Setting leader keys
I switched over from Doom and Spacemacs to writing my own Emacs configuration from scratch because those had too much lag time. As a general rule of thumb, if your cursor is lagging, it's time to change something. However, I did not want to sacrifice the mneumonic keybindings of Doom and Spacemacs. So, I wrote my own program. First we need to choose our "leader" keys. For global keybindings, I'll choose ~SPC~ and for major-mode keybindings, I'll choose ~,~.

#+BEGIN_SRC emacs-lisp
(defconst jc/global-leader "SPC")
(defconst jc/global-non-normal-leader "C-SPC")
(defconst jc/major-mode-leader ",")
(defconst jc/major-mode-non-normal-leader "C-c")
#+END_SRC

** Convert mode names to map names
This is going to be useful in a minute. When we define keybindings under major modes or minor modes, we have to tell ~general~ which keymaps we are binding under. As an example, if we wanted to bind under ~foo-mode~, we would enter ~foo-mode-map~ as the argument for ~:keymaps~ in ~general-define-key~. Every mode follows this syntax. So, instead of entering the actual map names, it would be easier to just enter the mode names and then convert them to map names. This is exactly what ~jc/mode-names->map-names~ does.

#+BEGIN_SRC emacs-lisp
(defun jc/mode-names->map-names (mode-names)
	 (if mode-names
	     (mapcar (lambda (mode) (intern (concat (symbol-name mode) "-map"))) mode-names)
	    'global-map))
#+END_SRC

** Make a general definer
Ok, here's where things start to get a little messy. I wrote the function ~jc/general-key-definer~ a general method for creating other, more specific key definers like ~jc/global-definer~, ~jc/minor-mode-definer~ and ~jc/major-mode-definer~. I think you can do this with a macro, but I haven't gotten that far just yet.

#+BEGIN_SRC emacs-lisp
(defun jc/general-key-definer (modes leader non-normal-leader &rest bindings)
  (let ((key (pop bindings))
	(cmd (pop bindings)))
    (while key
      (general-define-key :states '(normal visual insert)
			  :keymaps (jc/mode-names->map-names modes)
			  :prefix leader
			  :non-normal-prefix non-normal-leader
			  key cmd)
      (setq key (pop bindings)
	    cmd (pop bindings)))))
#+END_SRC

** Use general-key-definer
   Now, we use ~jc/general-key-definer~ to make some definers. As an example, if ~jc/global-definer~ is given some keybindings, it will automatically bind those to the global keymap with the appropriate leaders. When ~jc/major-mode-definer~ is given a list of modes and some binings, it will define those keybingings under the respective keymaps of the major modes with the appropriate leader keys, which in this case happen to be ~,~ in normal mode and ~C-c~ in insert mode.

#+BEGIN_SRC emacs-lisp
(defun jc/global-definer (&rest bindings)
  (apply 'jc/general-key-definer (append (list nil
					    jc/global-leader
					    jc/global-non-normal-leader)
				      bindings)))

(defun jc/minor-mode-definer (modes &rest bindings)
  (apply 'jc/general-key-definer (append (list modes
					    jc/global-leader
					    jc/global-non-normal-leader)
				      bindings)))

(defun jc/major-mode-definer (modes &rest bindings)
  (apply 'jc/general-key-definer (append (list modes
					    jc/major-mode-leader
					    jc/major-mode-non-normal-leader)
				      bindings)))
#+END_SRC

** Make general group definer
Here's where the fun begins. This is the whole reason why I'm writing this complicated program in the first place. This might be overkill, and I'm not even sure if Spacemacs and Doom have a feature like this. Essentially, what I want to do is to be able to define keys under a certain /group/. Here's what I mean by that. In Spacemacs, if you type ~SPC f~ in normal mode, a menu pops up with a whole bunch of options. You can press ~f~ again to find a file, ~s~ to save it, ~R~ to rename it, ect. I want to streamline this process.

#+BEGIN_SRC emacs-lisp :tangle no
  (jc/general-group-definer nil jc/global-leader jc/global-non-normal-leader "f" "Files"
   (list "f" 'find-file "Find file")
   (list "s" 'save-file "Save file")
   (list "R" 'rename-file "Rename file")) 
#+END_SRC

So the code above would do exactly that. By pressing ~SPC~, you would see the ~which-key~ prompt for "Files" under ~f~. Then, if you pressed ~f~, you would be taken to a group of keys that also have ~which-key~ aliases. Pretty cool! How the function is implemented is irrelavent, so long as you understand how input the arguments correctly.

#+BEGIN_SRC emacs-lisp
(defun jc/general-group-definer (modes leader non-normal-leader group-key group-name &rest bindings)
   (defun jc/define-key-under-group (key cmd alias)
      (jc/general-key-definer modes
			   leader
			   non-normal-leader
			   (format "%s%s" group-key key)
			   (list cmd :which-key alias)))
	  (jc/general-key-definer modes leader non-normal-leader group-key (list :ignore t :which-key group-name))
	  (let ((current-binding (pop bindings)))
	    (while current-binding
	      (let ((key (pop current-binding))
		    (cmd (pop current-binding))
		    (alias (if current-binding (pop current-binding) (symbol-name cmd))))
		(jc/define-key-under-group key cmd alias)
		(setq current-binding (pop bindings))))))
#+END_SRC

