config.el
(require 'package)
(setq package-enable-at-startup nil)
(setq package-archives '(("org"       . "http://orgmode.org/elpa/")
			 ("gnu"       . "http://elpa.gnu.org/packages/")
			 ("MELPA Stable"     . "https://stable.melpa.org/packages/")))

(setq use-package-always-ensure t)

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package)

(setq straight-use-package-by-default t)

(when window-system
  (set-frame-position (selected-frame) -1 -1)
  (set-frame-size (selected-frame) 140 120))

(menu-bar-mode -1)
(tool-bar-mode -1) 
(blink-cursor-mode -1)
(scroll-bar-mode -1)
(global-hl-line-mode 1) 
(global-visual-line-mode 1)

(setq coding-system-for-read 'utf-8
      coding-system-for-write 'utf-8
      default-file-name-coding-system 'utf-8
      ring-bell-function 'ignore ;; disable the sound of hell
      inhibit-startup-screen +1
      make-backup-files -1
      sentence-end-double-space nil
      default-fill-column 80)		

(set-language-environment 'utf-8)      
(prefer-coding-system 'utf-8)   
(set-default-coding-systems 'utf-8)                                                         
(set-terminal-coding-system 'utf-8)                                                         
(set-keyboard-coding-system 'utf-8)    

;; Treat clipboard input as UTF-8 string first; compound text next, etc.                    
(setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))

(setq user-full-name "Jeremy Clark"
      user-mail-address "jeremyclark456@gmail.com")

(use-package solarized-theme :straight t)
(add-hook 'after-init-hook (lambda () (load-theme 'solarized-light :NO-CONFIRM t)))

(use-package general
  :config (general-evil-setup))
(use-package which-key
  :init (which-key-mode)
  :config
  (setq which-key-popup-type 'minibuffer))

(defconst jc/global-leader "SPC")
(defconst jc/global-non-normal-leader "C-SPC")
(defconst jc/major-mode-leader ",")
(defconst jc/major-mode-non-normal-leader "C-c")

(defun jc/mode-names->map-names (mode-names)
	 (if mode-names
	     (mapcar (lambda (mode) (intern (concat (symbol-name mode) "-map"))) mode-names)
	    'global-map))

(defun jc/general-key-definer (modes leader non-normal-leader &rest bindings)
  (let ((key (pop bindings))
	(cmd (pop bindings)))
    (while key
      (general-define-key :states '(normal visual insert)
			  :keymaps (jc/mode-names->map-names modes)
			  :prefix leader
			  :non-normal-prefix non-normal-leader
			  key cmd)
      (setq key (pop bindings)
	    cmd (pop bindings)))))

(defun jc/global-definer (&rest bindings)
  (apply 'jc/general-key-definer (append (list nil
					    jc/global-leader
					    jc/global-non-normal-leader)
				      bindings)))

(defun jc/minor-mode-definer (modes &rest bindings)
  (apply 'jc/general-key-definer (append (list modes
					    jc/global-leader
					    jc/global-non-normal-leader)
				      bindings)))

(defun jc/major-mode-definer (modes &rest bindings)
  (apply 'jc/general-key-definer (append (list modes
					    jc/major-mode-leader
					    jc/major-mode-non-normal-leader)
				      bindings)))

(defun jc/general-group-definer (modes leader non-normal-leader group-key group-name &rest bindings)
   (defun jc/define-key-under-group (key cmd alias)
      (jc/general-key-definer modes
			   leader
			   non-normal-leader
			   (format "%s%s" group-key key)
			   (list cmd :which-key alias)))
	  (jc/general-key-definer modes leader non-normal-leader group-key (list :ignore t :which-key group-name))
	  (let ((current-binding (pop bindings)))
	    (while current-binding
	      (let ((key (pop current-binding))
		    (cmd (pop current-binding))
		    (alias (if current-binding (pop current-binding) (symbol-name cmd))))
		(jc/define-key-under-group key cmd alias)
		(setq current-binding (pop bindings))))))
