config.org
** Use general-group-definer
Now, we can use this general implementation to define more specific cases. With the following functions, my example above could be rewritten as

#+BEGIN_SRC emacs-lisp :tangle no
  (jc/make-global-key-group "f" "Files"
     (list "f" 'find-file "Find file")
     (list "s" 'save-file "Save file")
     (list "R" 'rename-file "Rename file"))
#+END_SRC

I will be using these a lot.

#+BEGIN_SRC emacs-lisp
(defun jc/make-major-mode-key-group (group-key group-name modes &rest bindings)
  (apply 'jc/general-group-definer (append (list modes
					      jc/major-mode-leader
					      jc/major-mode-non-normal-leader
					      group-key
					      group-name)
					bindings)))

(defun jc/make-minor-mode-key-group (group-key group-name modes &rest bindings)
  (apply 'jc/general-group-definer (append (list modes
					      jc/global-leader
					      jc/global-non-normal-leader
					      group-key
					      group-name)
					bindings)))

(defun jc/make-global-key-group (group-key group-name &rest bindings)
  (apply 'jc/general-group-definer (append (list nil
					      jc/global-leader
					      jc/global-non-normal-leader
					      group-key
					      group-name)
					bindings)))
#+END_SRC

** Global keybindings
Now, the fruits of our labor pay off. Let's do some keybinding! First, we've got the Files group, which has some pretty self-explanatory functions. I added the binding ~SPC f i~ to automatically open the init file. I defined my own init-file variable because ~user-init-file~ goes to ~/.emacs.d/init.el, which then uses Chemacs to go over to this version.
*** Files
At this point I have gotten so used to closing and restarting emacs every time I make a change. As I am just getting things set up, this happens to be a lot. If I've learned anything so far from Emacs, it is that there is always room for more efficiency. Let's write a function to do it instead. We can bind this under the /SPC f/ group.
#+begin_src emacs-lisp
  (defun jc/reload-config ()
    (interactive)
    (org-babel-load-file jc/literate-config-file-location))
#+end_src

#+BEGIN_SRC emacs-lisp
  (defconst jc/init-file-location "~/.emacs.default/init.el")
  (defconst jc/literate-config-file-location "~/.emacs.default/config.org")
  (defun jc/open-init-file ()
    (interactive)
    (switch-to-buffer (find-file-noselect jc/init-file-location)))
  (defun jc/open-literate-config-file ()
    (interactive)
    (switch-to-buffer (find-file-noselect jc/literate-config-file-location)))
  (jc/make-global-key-group "f" "Files"
			    (list "f" 'find-file "Find file")
			    (list "c" 'copy-file "Copy file")
			    (list "D" 'delete-file "Delete file")
			    (list "R" 'rename-file "Rename file")
			    (list "s" 'save-buffer "Save buffer")
			    (list "i" 'jc/open-init-file "Open init file")
			    (list "l" 'jc/open-literate-config-file "Open literate config")
			    (list "r" 'jc/reload-config "Reload config file"))
#+END_SRC

*** M-x
If we press ~SPC SPC~, we get the functionality of ~M-x~.

#+BEGIN_SRC emacs-lisp
(jc/global-definer "SPC" (list 'execute-extended-command :which-key "Execute command"))
#+END_SRC

*** Windows
On to windows. I installed ~window-numbering~ and made a few adjustments to fit my needs.

#+BEGIN_SRC emacs-lisp
  (use-package window-numbering
    :straight t
    :init (window-numbering-mode +1)
    :config (setq windmove-wrap-around t)) ;; Makes windows continuous like Pac Man

  
  (defun jc/switch-to-window-with-number (arg)
    (interactive "sWindow to switch to: ")
    (select-window-by-number (string-to-number arg)))
  (jc/make-global-key-group "w" "Window"
			 (list "h" 'windmove-left "Move left")
			 (list "j" 'windmove-down "Move down")
			 (list "k" 'windmove-up "Move up")
			 (list "l" 'windmove-right "Move right")
			 (list "d" 'delete-window "Delete window")
			 (list "s" 'split-window-vertically "Split vertical")
			 (list "v" 'split-window-horizontally "Split horizontal")
			 (list "n" 'jc/switch-to-window-with-number "Select window by number")
			 (list "b" 'previous-buffer "Previous buffer"))
#+END_SRC

*** Buffers
When I first got Emacs, it took me a minute to understand the difference between buffers, frames, windows, files, workspaces, etc. Now, I understand. I don't know why I am writing this introduction, as it is pretty much irrelavent. I guess it just felt awkward and impersonal not to write something.

#+begin_src emacs-lisp
(jc/make-global-key-group "b" "Buffer"
			  (list "b" 'switch-to-buffer "Go to buffer")
			  (list "x" 'kill-this-buffer "Kill buffer")
			  (list "r" 'rename-buffer "Rename buffer")
			  (list "p" 'previous-buffer "Previous buffer")
			  (list "n" 'next-buffer "Next buffer"))
#+end_src

* Templates
** YASnippet
*** Introduction/example
This library allows you to insert interactive templates using emacs lisp. So, you can use environment-specific variables to make each template appropriate for its lexical use. As an example, you can write, (note that this code block will not be tangled)

#+begin_src snippet :tangle no
# -*- mode: snippet -*-
# name: fraction-snippet
# key: frac
# --
\frac{${1:numerator}}{${2:denominator}}$0
#+end_src

So, if you have YASnippet mode enabled, when you write ~frac~ and press ~TAB~, a template will exapnd that looks like this:

\frac{numerator}{denominator} 

Your cursor will start at the word ~numerator~ because this is where ~1~ is. Once you start typing, whatever you type will replace ~numerator~. When you are finished filling out this field, you can press ~TAB~ again, which will bring you to denominator, where you can do the same thing. ~$0~ represents where the cursor will go once all of the fields have been filled out.

But it gets better because you can incorporate acutal Emacs Lisp into your YASnippets. Consider the following example, which, again, will not be tangled. Also, this specific example uses the ~rx~ library. If you try to import ~rx~ directly within the snippet, you run into problems because ~(require 'rx)~ expands to ~nil~, which we don't want. YASnippet has a solution for this, however. You can include a file called ~.yas-setup.el~ in the same directory as whatever your template is in to include library imports, variable definitions, function definitions, and pretty much anything else that is imperative and that you don't want expanded in your snippets. So, for the purpose of this example, you would have a ~.yas-setup.el~ file with the following contents:

#+begin_src emacs-lisp :tangle no
(require 'rx)
#+end_src

Now, we can move on to writing an actual snippet, which, again will not be tangled. Also note that ~[ZWS]~ is a unicode escape character, since this is written in org mode. In an actual file, you would just write the asterikses, but if you leave them unescaped here in the org file, it messes with the document structure. I wish the creators of org mode would automatically escape asterikses within source blocks, but I guess they have not gotten around to doing that. Or maybe there is some reason for not including this feature that I have not thought of. Either way, just know that ~[ZWS]~ would not normally be there.

#+begin_src snippet :tangle no
# -*- mode: snippet -*-
# name: document-header
# key: head
# --
\#+TITLE: Advent of Code Day `(string-match (rx (group (= 1 digit))) (file-name-nondirectory buffer-file-truename))`
\#+PROPERTY: header-args :tangle yes
[ZWS]* Setup
\#+begin_src python

\#end_src

[ZWS]* Part 1
[ZWS]*[ZWS]* Problem Statment

[ZWS]*[ZWS]* Solution

[ZWS]* Part 2
[ZWS]*[ZWS]* Problem Statment

[ZWS]*[ZWS]* Solution
   
[ZWS]* Running
\#+begin_src python
if __name__ == '__main__':
    print(f"Answer to Part 1: {part_1(data)}")
    print(f"Answer to Part 2: {part_2(data)}")
\#+end_src
#+end_src

We could (and probably will) take this a whole lot further by setting up a python/emacs program that scrapes the problem statements directly from Advent of Code website, but hopefully you can see how this works.

*** Setup
Now, let's actually get it set up. This is straight up plagiarized from [[http://www.howardism.org/Technical/Emacs/templates-tutorial.html][Howard Abrams.]]

#+begin_src emacs-lisp
(use-package yasnippet
       :ensure t
       :init
       (yas-global-mode 1)
       :config
       (add-to-list 'yas-snippet-dirs (locate-user-emacs-file "snippets")))
#+end_src

Continuing on with Howard's article, we can use autoinsert to create file templates, which are helpful if you create a bunch of files that have a very similar structure, like the Advent of Code example. Again, pretty much plagiarized. The first thing we are going to do is define a function called ~jc/autoinsert-yas-expand~, which essentially takes ~(buffer-string)~, deletes all the text in the file, and then pastes it in, using YAS expansions. So, you can write an entire template file with the emacs lisp surrounded by backticks in the places where you need contextual information. We will get to this later though. For now, remember that ~jc/autoinsert-yas-expand~ clears out all of the text in a file and replaces it with an expanded YAS template. It will only work, however, in collaboration with ~define-auto-insert~, which we will get around to in a second.

#+begin_src emacs-lisp
(defun jc/autoinsert-yas-expand()
  "Replace text in yasnippet template."
  (yas-expand-snippet (buffer-string) (point-min) (point-max)))
#+end_src

Alright, now that we have this function defined, we will use the autoinsert package. Essentially, autoinsert is great for whenever you have a bunch of files that are all have a similar basic outline. For example, if your company requires you to have a copyright notice on the top of every file in a project, you could write a template file and then write a regex to match all the target files so that, upon creation, they have the boilerplate stuff automatically. You can set up autoinserts with ~define-auto-insert~, which takes a regex to match the file path and a template file. So as an example, (not tangled)

#+begin_src emacs-lisp :tangle no
(define-auto-insert (rx ".el" eol) "my-copyright-template.el")
#+end_src

Would insert ~my-copyright-template.el~ any time a new file is created that ends in ~.el~. 

#+begin_src emacs-lisp
(use-package autoinsert
  :init
  ;; Don't want to be prompted before insertion:
  (setq auto-insert-query nil)
  
  ;; Store all template files in a directory called templates.
  (setq auto-insert-directory (locate-user-emacs-file "templates"))
  (add-hook 'find-file-hook 'auto-insert)
  (auto-insert-mode 1)
  :config
  (define-auto-insert (rx "/advent-of-code/day" (one-or-more digit) ".org" eol)
    ["default-aoc.org" jc/autoinsert-yas-expand]))
#+end_src

Now, I've got to explain this last part with ~define-auto-insert~ because I don't want to forget how it works. We saw a simplified example of ~define-auto-insert~ earlier, but this use case is more complicated because it incorporates the ~jc/autoinsert-yas-expand~ function described earlier. The second argument is a vector with the first element being "default-aoc.org" and the second being ~jc/autoinsert-yas-expand~. This use case allows us to combine the functionality of YAS and autoinsert. Essentially, "default-aoc.org" is just a regular template, except with context-specific emacs lisp code embedded within it, which allows every file to be unique. For example, if your file header needs to correspond with the file name, you could write a piece of emacs lisp code that takes the file name and parses it accordingly. Another use case could be dates.

