config.el

(defun jc/make-major-mode-key-group (group-key group-name modes &rest bindings)
  (apply 'jc/general-group-definer (append (list modes
					      jc/major-mode-leader
					      jc/major-mode-non-normal-leader
					      group-key
					      group-name)
					bindings)))

(defun jc/make-minor-mode-key-group (group-key group-name modes &rest bindings)
  (apply 'jc/general-group-definer (append (list modes
					      jc/global-leader
					      jc/global-non-normal-leader
					      group-key
					      group-name)
					bindings)))

(defun jc/make-global-key-group (group-key group-name &rest bindings)
  (apply 'jc/general-group-definer (append (list nil
					      jc/global-leader
					      jc/global-non-normal-leader
					      group-key
					      group-name)
					bindings)))

(defun jc/reload-config ()
  (interactive)
  (org-babel-load-file jc/literate-config-file-location))

(defconst jc/init-file-location "~/.emacs.default/init.el")
(defconst jc/literate-config-file-location "~/.emacs.default/config.org")
(defun jc/open-init-file ()
  (interactive)
  (switch-to-buffer (find-file-noselect jc/init-file-location)))
(defun jc/open-literate-config-file ()
  (interactive)
  (switch-to-buffer (find-file-noselect jc/literate-config-file-location)))
(jc/make-global-key-group "f" "Files"
			  (list "f" 'find-file "Find file")
			  (list "c" 'copy-file "Copy file")
			  (list "D" 'delete-file "Delete file")
			  (list "R" 'rename-file "Rename file")
			  (list "s" 'save-buffer "Save buffer")
			  (list "i" 'jc/open-init-file "Open init file")
			  (list "l" 'jc/open-literate-config-file "Open literate config")
			  (list "r" 'jc/reload-config "Reload config file"))

(jc/global-definer "SPC" (list 'execute-extended-command :which-key "Execute command"))

(use-package window-numbering
  :straight t
  :init (window-numbering-mode +1)
  :config (setq windmove-wrap-around t)) ;; Makes windows continuous like Pac Man


(defun jc/switch-to-window-with-number (arg)
  (interactive "sWindow to switch to: ")
  (select-window-by-number (string-to-number arg)))
(jc/make-global-key-group "w" "Window"
		       (list "h" 'windmove-left "Move left")
		       (list "j" 'windmove-down "Move down")
		       (list "k" 'windmove-up "Move up")
		       (list "l" 'windmove-right "Move right")
		       (list "d" 'delete-window "Delete window")
		       (list "s" 'split-window-vertically "Split vertical")
		       (list "v" 'split-window-horizontally "Split horizontal")
		       (list "n" 'jc/switch-to-window-with-number "Select window by number")
		       (list "b" 'previous-buffer "Previous buffer"))

(jc/make-global-key-group "b" "Buffer"
			  (list "b" 'switch-to-buffer "Go to buffer")
			  (list "x" 'kill-this-buffer "Kill buffer")
			  (list "r" 'rename-buffer "Rename buffer")
			  (list "p" 'previous-buffer "Previous buffer")
			  (list "n" 'next-buffer "Next buffer"))

(use-package yasnippet
       :ensure t
       :init
       (yas-global-mode 1)
       :config
       (add-to-list 'yas-snippet-dirs (locate-user-emacs-file "snippets")))

(defun jc/autoinsert-yas-expand()
  "Replace text in yasnippet template."
  (yas-expand-snippet (buffer-string) (point-min) (point-max)))

(use-package autoinsert
  :init
  ;; Don't want to be prompted before insertion:
  (setq auto-insert-query nil)
  
  ;; Store all template files in a directory called templates.
  (setq auto-insert-directory (locate-user-emacs-file "templates"))
  (add-hook 'find-file-hook 'auto-insert)
  (auto-insert-mode 1)
  :config
  (define-auto-insert (rx "/advent-of-code/day" (one-or-more digit) ".org" eol)
    ["default-aoc.org" jc/autoinsert-yas-expand]))
