config.org
* Evil mode
Evil mode is fantastic. It combines the best parts of Vim with the best parts of Emacs to make a text editor that is truly amazing. I highly recommmend Evil mode.

#+BEGIN_SRC emacs-lisp
(use-package evil
  :init (evil-mode 1)
  :config
  (setq evil-search-module 'evil-search)
  (setq evil-ex-complete-emacs-commands nil)
  (setq evil-emacs-state-modes nil)
  (setq evil-emacs-insert-state-modes nil)
  (setq evil-motion-state-modes nil))
#+END_SRC

Evil smartparens can be integrated into evil mode. Smartparens does autocompletion for parentheses.

#+begin_src emacs-lisp
(use-package evil-smartparens
  :config (add-hook 'smartparens-enabled-hook #'evil-smartparens-mode)
  (add-hook #'python-mode-hook #'smartparens-mode))
#+end_src

* Searching capabilities
These three packages make searching for files much more efficient.

#+BEGIN_SRC emacs-lisp
(use-package orderless
  :straight t
  :config
  (setq completion-styles '(orderless))
  (setq orderless-skip-highlighting (lambda () selectrum-is-active)))

(use-package selectrum
  :straight t
  :init (selectrum-mode)
  :config
  (setq selectrum-prescient-enable-filtering nil)
  (savehist-mode)
  (setq selectrum-highlight-candidates-function #'orderless-highlight-matches))

(use-package selectrum-prescient
  :straight t
  :after selectrum
  :config (selectrum-prescient-mode))
#+END_SRC

* Modeline
Maybe someday I will make my own modeline, but for now I just use the doom modeline.

#+BEGIN_SRC emacs-lisp
(use-package all-the-icons)
(use-package doom-modeline
  :init (doom-modeline-mode 1))
#+END_SRC

* Speed-of-thought lisp
Lisp is great, but it's also notoriously difficult to edit with all of those parentheses. When writing lisp, you end up spending more time messing around with parentheses than writing useful code. My goal is to mitigate this with some packages that enable you to write Lisp at the speed of thought. Might be easier said than done though because I am still getting used to this split keyboard.

#+BEGIN_SRC emacs-lisp
(use-package lispy
  :straight t
  :defer t
  :hook ((lisp-mode . lispy-mode)
	 (emacs-lisp-mode . lispy-mode)))

(use-package lispyville
  :straight t
  :defer t
  :hook (lispy-mode . lispyville-mode)
  :config
  (lispyville-set-key-theme '((operators normal) ;; These are the functionalities that I have enabled for Lispyville.
			      (atom-motions normal)
			      (additional-movement normal)
			      (commentary normal)
			      (slurp/barf-cp normal)
			      (additional normal visual)
			      (additional-insert normal visual))))
#+END_SRC

* Flycheck
It's nice to have a linter. This one is definitely a work in progress, but it is better than nothing.

#+BEGIN_SRC emacs-lisp
(use-package flycheck
  :straight t
  :init (global-flycheck-mode)
  :custom
  (flycheck-display-errors-delay 2))
#+END_SRC

* Org mode
  Ah yes, Org mode. Possibly the best feature in Emacs. In fact, I am writing this configuration in org mode and then tangling the code blocks to a .el file. It is pretty fantastic. Org mode can be an IDE, a journal, a blog, a to-do list, an academic paper, notes and much, much more.

** Pretty code blocks
I want syntax highlighting on my org mode code blocks.
#+begin_src emacs-lisp
  (add-hook 'org-mode-hook (lambda ()
			     (setq org-src-fontify-natively t
				   org-src-tab-acts-natively t
				   org-edit-src-content-indentation 0)))
#+end_src

** Org-edit-special
  First, let's change something that has been really bothering me. I love using ~org-edit-special~ to edit babel code blocks, but every time I use it, it replaces another window with the special editing buffer. When I exit, it deletes that window. So I have to constantly reopen windows that ~org-edit-special~ kills, which is really annoying. The following code makes it so that ~org-edit-special~ replaces the current buffer with the special buffer. When you close the special buffer, the previous buffer comes back. This is much more convenient. Someday, I would like to be able to simply edit source blocks natively without having to edit in a special mode, but nobody on the internet has seemed to figure out how to do this. Maybe I will do an open source contribution to Org mode to add this feature.

#+BEGIN_SRC emacs-lisp
(setq org-src-window-setup 'current-window)
#+END_SRC

** Source block insertion
   It is kind of a hassle to have to manually type in the surroundings for a code block every time. Let's use a shortcut. According to Stack Exchange, you also need org-tempo for this to work. Don't ask me why. I don't even know what it does. I just know that we need it for some reason. I have tried to figure out how to use <sTAB to complete this, but for some reason this does not work. I will just have to stick with C-c C-, s for now because I cannot figure out why TAB is not working for autocompletion.

#+BEGIN_SRC emacs-lisp
  (require 'org-tempo)
  (setq org-structure-template-alist '(("s" . "src")))
#+END_SRC
** SICP
It is nice to have a few packages for doing SICP exercises. This is a cool mode for editing scheme languages.

#+begin_src emacs-lisp
  (use-package geiser-mit
    :config (setq geiser-racket-binary "/usr/bin/racket"
		  geiser-active-implementations '(racket)
		  geiser-default-implementations '(racket)))
#+end_src

We can make these languages compatible with org babel with the following. This way, we can do exercises in an org file and explain the answers in depth without having to worry about comment junk.

#+begin_src emacs-lisp
(org-babel-do-load-languages 'org-babel-load-languages '((scheme . t)
							 (python . t)))
#+end_src

I have been using Racket to do SICP exercises.

#+begin_src emacs-lisp
(use-package racket-mode
  :config (setq racket-program "/usr/bin/racket"))
#+end_src

* Python
** Elpy
   Elpy pretty much allows you to set up a Python IDE in Emacs.

   #+begin_src emacs-lisp
   (use-package elpy
     :config (add-hook 'python-mode-hook 'elpy-enable)
     (setq elpy-rpc-python-command (file-truename "/usr/bin/python3")))
   #+end_src
