config.el

(use-package evil
  :init (evil-mode 1)
  :config
  (setq evil-search-module 'evil-search)
  (setq evil-ex-complete-emacs-commands nil)
  (setq evil-emacs-state-modes nil)
  (setq evil-emacs-insert-state-modes nil)
  (setq evil-motion-state-modes nil))

(use-package evil-smartparens
  :config (add-hook 'smartparens-enabled-hook #'evil-smartparens-mode)
  (add-hook #'python-mode-hook #'smartparens-mode))

(use-package orderless
  :straight t
  :config
  (setq completion-styles '(orderless))
  (setq orderless-skip-highlighting (lambda () selectrum-is-active)))

(use-package selectrum
  :straight t
  :init (selectrum-mode)
  :config
  (setq selectrum-prescient-enable-filtering nil)
  (savehist-mode)
  (setq selectrum-highlight-candidates-function #'orderless-highlight-matches))

(use-package selectrum-prescient
  :straight t
  :after selectrum
  :config (selectrum-prescient-mode))

(use-package all-the-icons)
(use-package doom-modeline
  :init (doom-modeline-mode 1))

(use-package lispy
  :straight t
  :defer t
  :hook ((lisp-mode . lispy-mode)
	 (emacs-lisp-mode . lispy-mode)))

(use-package lispyville
  :straight t
  :defer t
  :hook (lispy-mode . lispyville-mode)
  :config
  (lispyville-set-key-theme '((operators normal) ;; These are the functionalities that I have enabled for Lispyville.
			      (atom-motions normal)
			      (additional-movement normal)
			      (commentary normal)
			      (slurp/barf-cp normal)
			      (additional normal visual)
			      (additional-insert normal visual))))

(use-package flycheck
  :straight t
  :init (global-flycheck-mode)
  :custom
  (flycheck-display-errors-delay 2))

(add-hook 'org-mode-hook (lambda ()
			   (setq org-src-fontify-natively t
				 org-src-tab-acts-natively t
				 org-edit-src-content-indentation 0)))

(setq org-src-window-setup 'current-window)

(require 'org-tempo)
(setq org-structure-template-alist '(("s" . "src")))

(use-package geiser-mit
  :config (setq geiser-racket-binary "/usr/bin/racket"
		geiser-active-implementations '(racket)
		geiser-default-implementations '(racket)))

(org-babel-do-load-languages 'org-babel-load-languages '((scheme . t)
							 (python . t)))

(use-package racket-mode
  :config (setq racket-program "/usr/bin/racket"))

(use-package elpy
  :config (add-hook 'python-mode-hook 'elpy-enable)
  (setq elpy-rpc-python-command (file-truename "/usr/bin/python3")))
